import re

# 原始字符串
string = "$00000 00000 00000 00000 00000 00000 00000AAAA 00000 00000 04086 00001 00000 00000 02858 00000 00001 00051 00000 00000 00100 00101 00102 01280 00000 00000 00001 00000 00000 00000 00000 00000 00000 00000 00000BBBBB 00000 00000 00000 00000 00000 00000 00413"

# 使用正则表达式删除字符串中除数字以外的所有字符
string = re.sub(r'\D', '', string)

# 将字符串按照每五个字符一组分割
groups = [string[i:i+5] for i in range(0, len(string), 5)]
print(groups[0])
# 或者存储到元组中
groups_tuple = tuple(groups)

print("列表:", groups)
print("元组:", groups_tuple)
